Revit 2027 API
CompoundStructureLayer.Function Property
 The function of the layer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MaterialFunctionAssignment Function { get; set; }
Public Property Function As MaterialFunctionAssignment
	Get
	Set
public:
property MaterialFunctionAssignment Function {
	MaterialFunctionAssignment get ();
	void set (MaterialFunctionAssignment value);
}
member Function : MaterialFunctionAssignment with get, set
Property Value
MaterialFunctionAssignment
 The default is MaterialFunctionAssignment.None.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
CompoundStructureLayer Class
Autodesk.Revit.DB Namespace